entry_registration = 'сначала вам нужно создать свое резюме, <b>скажи мне свой возраст</b>'

acc_send_warn = 'упс... ошибка с отправкой твоего профиля'

start_warn = 'сначала отправь мне комманду /start'

help = 'если ты нашел недочет, то напиши об этом мне - @VictorMerinov и так же ты можешь перезагрузить бота - /restart'

change_lang_good = 'ты успешно поменял язык на <b>Русский</b>'

invalid_t_age = 'значение вашего возраста выходит за пределы разумного (10 - 99)'

invalid_v_age = 'возраст должен быть целым числом, без дробей и символов (11, 12, ..., 99)'

invalid_citi = '<b>не нахожу</b> такого в базе... введите более большой населенный пункт'

invalid_l_desc = "максимальная длинна вашего этого текста ограничена - всего 350 символов " \
                 "(но вы уже написали более '<b>{}</b> знаков)"

invalid_t_photo = 'на место вашей фотографии претендует только изображение...'

q_city = 'из какого ты <b>города</b>?'

q_sex = 'кокой у тебя <b>пол</b>?'

q_desc = 'расскажи <b>о себе</b>'

q_photo = u'\u2728 и последнее, отправь мне свое будущее фото профиля'

q_age_range = 'введите новые границы возраста для поиска, учитывайте, они должны быть не меньше 10 и не больше 99'

q_age = 'сколько тебе <b>лет</b>'

btn_change = u'\u270F я хочу кое что поменять'

btn_creator = '🤙 отец'

btn_start_find = '🌐 искать хороших людей'

btn_back = u'\u2B05 назад'

btn_change_photo = u'\u270F фото'

btn_change_age = u'\u270F возраст'

btn_change_city = u'\u270F город'

btn_change_description = u'\u270F описание'

btn_change_sex = u'\u270F пол'

fatal_err = 'кажется ты сломал систему...('

q_new_photo = 'отправь мне более подходящее фото'

q_new_age = 'скажи мне, на сколько ты вырос'

q_new_city = 'введи свой новый город'

q_new_desc = 'уточни информацию про себя'

end_chatting = 'вы спешно закончили общение'

clarify = '🔎 ты хочешь <b>уточнить</b> данные о <b>людях</b>, которых хочешь <b>найти</b>?'

do_clairfy = u'\u2699 да, хочу'

start_find = '🔮 начать магию'

profile_templ = '{name}, {age} {declination}, {city}\n<i>{desc}</i>'

change_find_params = u'данные для поиска исходя из твоего профиля:\n\n' \
                     u'🌆 город: <code>{}</code>\n' \
                     u'\u231B возраст: from <code>{}</code> to <code>{}</code>\n' \
                     u'🧬 искомый пол: <code>{}</code>\n'

man = 'я мужчина'

woman = 'я женщина'

not_spec_users_warn = 'Не найдено ни одного пользователя по назначенным условиям'

not_fast_users_warn = 'Не найдено пользователей'

find_successful = 'Пользователь найден, соблюдайте правила общения в интернете, ' \
                  'для прекращения разговора отправь мне - /end'

find_from_buffer = 'наконец твой собесседник нашелся, хорошего вам разговора,' \
                   ' не забывайте о правилах общения в интернете,' \
                   ' для прекращения разговора - /end'

start_fast_find = u'\u2705 магия, только без параметров'
